uhnp/src/Catalogs/АналитическиеПанели/АналитическиеПанели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитическиеПанели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ПакетыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазметкаПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>EnumRef.ВидыЭлементовАналитическойПанели</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиЭлемента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяГруппыЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкрытьЗаголовокЭлемента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксироватьОтборы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтраницыПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтраницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветФонаСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеИБ</name>
    <attributes>
      <name>ТипИБ</name>
      <type>
        <types>CatalogRef.ТипыБазДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ВнешниеИнформационныеБазы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ВидыЭлементовАналитическойПанели/ВидыЭлементовАналитическойПанели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовАналитическойПанели</name>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>Гистограмма</name>
  </enumValues>
  <enumValues>
    <name>График</name>
  </enumValues>
  <enumValues>
    <name>КруговаяДиаграмма</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаГоризонтальная</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСОбластями</name>
  </enumValues>
  <enumValues>
    <name>ТочечнаяДиаграмма</name>
  </enumValues>
  <enumValues>
    <name>ИзмерительнаяДиаграмма</name>
  </enumValues>
  <enumValues>
    <name>РадарныйГрафик</name>
  </enumValues>
  <enumValues>
    <name>Воронка</name>
  </enumValues>
  <enumValues>
    <name>Поверхность</name>
  </enumValues>
  <enumValues>
    <name>ПолеИндикатора</name>
  </enumValues>
  <enumValues>
    <name>ДекорацияКартинка</name>
  </enumValues>
  <enumValues>
    <name>ДекорацияНадпись</name>
  </enumValues>
  <enumValues>
    <name>ДиаграммаГанта</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/АналитическиеПанели/Forms/ФормаУправленияРазметкойСтраницы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭлементыТекущейСтраницы = Параметры.РазметкаПанели.НайтиСтроки(Новый Структура("ИмяСтраницы",Параметры.ТекущаяСтраницаИмя));
	ТекущаяСтраницаИмя      = Параметры.ТекущаяСтраницаИмя;
	
	Для Каждого СтрСостава Из ЭлементыТекущейСтраницы Цикл	
		 тНоваяСтрока = РазметкаПанели.Добавить();
		 ЗаполнитьЗначенияСвойств(тНоваяСтрока,СтрСостава);		 
	КонецЦикла;	
	
	РазметкаПанели.Сортировать("ИндексСтроки,ИндексКолонки");
	
	ИндексСтроки = 0;
	Для Каждого СтрСоставаСтраницы Из РазметкаПанели Цикл
		
		Если Не ИндексСтроки = СтрСоставаСтраницы.ИндексСтроки Тогда		
			нСтрокаДерева 						= РазметкаПанелиДерево.ПолучитьЭлементы().Добавить();
			нСтрокаДерева.ЗаголовокЭлемента     = НСтр("ru = 'Строка панели '")+СтрСоставаСтраницы.ИндексСтроки;
			ИндексСтроки  = СтрСоставаСтраницы.ИндексСтроки;
			нСтрокаДерева.ИндексКартинки = 0;
		КонецЕсли;	
		
		нЭлементДерева = нСтрокаДерева.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(нЭлементДерева,СтрСоставаСтраницы);
		Если нЭлементДерева.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.ПустаяСсылка() Тогда
			нЭлементДерева.ИндексКартинки = 1;
		ИначеЕсли нЭлементДерева.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.Таблица Тогда
			нЭлементДерева.ИндексКартинки = 2;
		ИначеЕсли нЭлементДерева.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.ПолеИндикатора Тогда
			нЭлементДерева.ИндексКартинки = 3;
		ИначеЕсли нЭлементДерева.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.ДекорацияКартинка
			ИЛИ нЭлементДерева.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.ДекорацияНадпись Тогда
			нЭлементДерева.ИндексКартинки = 4;
		Иначе
			нЭлементДерева.ИндексКартинки = 5;	
		КонецЕсли;	
			
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	РазметкаПанели.Очистить();	
	ИндексСтроки = 1;
	
	Для Каждого СтрГруппа Из РазметкаПанелиДерево.ПолучитьЭлементы() Цикл
		
		ИндексКолонки = 1;
		
		Для Каждого СтрЭлемент Из СтрГруппа.ПолучитьЭлементы() Цикл 
			
			  нЭлементРазметки = РазметкаПанели.Добавить();
			  ЗаполнитьЗначенияСвойств(нЭлементРазметки,СтрЭлемент);
						  
			  нЭлементРазметки.ИндексСтроки 	= ИндексСтроки;
			  нЭлементРазметки.ИндексКолонки    = ИндексКолонки;
			  
			  ИндексКолонки = ИндексКолонки+1;
		  
		КонецЦикла;	
		
		ИндексСтроки = ИндексСтроки+1;				
		
	КонецЦикла;	
	
	Закрыть(РазметкаПанели);

КонецПроцедуры

&НаКлиенте
Процедура РазметкаПанелиДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

   СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура РазметкаПанелиДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	ИндексСтроки = РазметкаПанелиДерево.ПолучитьЭлементы().Количество()+1;
	
	нСтрокаДерева 						= РазметкаПанелиДерево.ПолучитьЭлементы().Добавить();
	нСтрокаДерева.ЗаголовокЭлемента     = НСтр("ru = 'Строка панели '")+ИндексСтроки;
	ИндексСтроки  = ИндексСтроки;
	нСтрокаДерева.ИндексКартинки = 0;	
	
	нЭлементДерева = нСтрокаДерева.ПолучитьЭлементы().Добавить();
	нЭлементДерева.ИндексКартинки = 1;
	
	нЭлементДерева.ИмяСтраницы = ТекущаяСтраницаИмя;
	нЭлементДерева.ИндексСтроки = ИндексСтроки;
	нЭлементДерева.ИндексКолонки = 1;
    нЭлементДерева.ИмяЭлемента     	= "Элемент_"+ТекущаяСтраницаИмя+"_"+нЭлементДерева.ИндексСтроки+"_"+нЭлементДерева.ИндексКолонки;
	нЭлементДерева.ИмяГруппыЭлемента  	= "ЭлементГруппа_"+ТекущаяСтраницаИмя+"_"+нЭлементДерева.ИндексСтроки+"_"+нЭлементДерева.ИндексКолонки;
	нЭлементДерева.ЗаголовокЭлемента   = Нстр("ru = 'Новый элемент'");
	
	нЭлементДерева.НастройкиЭлемента = ПолучитьНастройкиПоУмолчанию();
	
КонецПроцедуры  

Функция ПолучитьНастройкиПоУмолчанию()
	
	Возврат Справочники.АналитическиеПанели.ПолучитьНастройкиОбъектаПоУмолчанию();

КонецФункции	

&НаКлиенте
Процедура ДобавитьЭлемент(Команда)
	
	Если РазметкаПанелиДерево.ПолучитьЭлементы().Количество() = 0 Тогда
		ДобавитьГруппу(Неопределено);
		Возврат;
	КонецЕсли;	
	
	Если Элементы.РазметкаПанелиДерево.ТекущиеДанные.ИндексКартинки = 0 Тогда
		 нСтрокаДерева = РазметкаПанелиДерево.НайтиПоИдентификатору(Элементы.РазметкаПанелиДерево.ТекущаяСтрока);
	Иначе	
		 нСтрокаДерева = РазметкаПанелиДерево.НайтиПоИдентификатору(Элементы.РазметкаПанелиДерево.ТекущаяСтрока).ПолучитьРодителя();
	КонецЕсли;	
	
	ИндексСтроки = нСтрокаДерева.ИндексСтроки;	
	ИндексКолонки = нСтрокаДерева.ПолучитьЭлементы().Количество()+1;
	
	нЭлементДерева = нСтрокаДерева.ПолучитьЭлементы().Добавить();
	нЭлементДерева.ИндексКартинки = 1;
	
	нЭлементДерева.ИмяСтраницы 		= ТекущаяСтраницаИмя;
	нЭлементДерева.ИндексСтроки 	= ИндексСтроки;
	нЭлементДерева.ИндексКолонки 	= ИндексКолонки;
    нЭлементДерева.ИмяЭлемента     	= "Элемент_"+ТекущаяСтраницаИмя+"_"+нЭлементДерева.ИндексСтроки+"_"+нЭлементДерева.ИндексКолонки;
	нЭлементДерева.ИмяГруппыЭлемента = "ЭлементГруппа_"+ТекущаяСтраницаИмя+"_"+нЭлементДерева.ИндексСтроки+"_"+нЭлементДерева.ИндексКолонки;
	нЭлементДерева.ЗаголовокЭлемента   = Нстр("ru = 'Новый элемент'");
	
	нЭлементДерева.НастройкиЭлемента = ПолучитьНастройкиПоУмолчанию();

		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСвойстваОбласти(Команда)

	Оповещение = Новый ОписаниеОповещения("ИзменитьСвойстваОбластиЗавершение", ЭтаФорма);
				
	ОткрытьФорму("Справочник.АналитическиеПанели.Форма.ФормаИзмененияСвойствГруппыОбластей",,ЭтаФорма,Истина,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСвойстваОбластиЗавершение(Результат, ДополнительныеПараметры) Экспорт      
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Отмена  Тогда
		Возврат;
	КонецЕсли;	
	
	Если РазметкаПанелиДерево.ПолучитьЭлементы().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого ВыделеннаяСтрока Из Элементы.РазметкаПанелиДерево.ВыделенныеСтроки Цикл
		
		нСтрокаДерева = РазметкаПанелиДерево.НайтиПоИдентификатору(ВыделеннаяСтрока);	
		Если нСтрокаДерева.ИндексКартинки = 0 Тогда
			тЭлементы     = нСтрокаДерева.ПолучитьЭлементы();
			Для Каждого Стр Из тЭлементы Цикл
				Стр.СкрытьЗаголовокЭлемента 	= Результат.СкрытьЗаголовокЭлемента;
				Стр.НастройкиЭлемента 		=  ИзменитьСвойстваОбластиСервер(Стр.НастройкиЭлемента,Результат);		
			КонецЦикла;	 		
		Иначе	
			нСтрокаДерева.СкрытьЗаголовокЭлемента 	= Результат.СкрытьЗаголовокЭлемента;
			нСтрокаДерева.НастройкиЭлемента 		=  ИзменитьСвойстваОбластиСервер(нСтрокаДерева.НастройкиЭлемента,Результат);	
		КонецЕсли;	
	КонецЦикла;
		
КонецПроцедуры

Функция ИзменитьСвойстваОбластиСервер(НастройкиЭлемента,Результат);
	
	тНастройкиЭлемента = ЗначениеИзСтрокиВнутр(НастройкиЭлемента);
	
	тНастройкиЭлемента.Ширина 					= Результат.НастройкиЭлемента.Ширина;
	тНастройкиЭлемента.Высота 					= Результат.НастройкиЭлемента.Высота;
	тНастройкиЭлемента.РастягиватьПоВертикали 	= Результат.НастройкиЭлемента.РастягиватьПоВертикали;
	тНастройкиЭлемента.РастягиватьПоГоризонтали 	= Результат.НастройкиЭлемента.РастягиватьПоГоризонтали;
	
	тНастройкиЭлемента.АвтомаксимальнаяВысота 	= Результат.НастройкиЭлемента.АвтомаксимальнаяВысота;
	тНастройкиЭлемента.АвтомаксимальнаяШирина 	= Результат.НастройкиЭлемента.АвтомаксимальнаяШирина;
	тНастройкиЭлемента.МаксимальнаяВысота 		= Результат.НастройкиЭлемента.МаксимальнаяВысота;
	тНастройкиЭлемента.МаксимальнаяШирина 		= Результат.НастройкиЭлемента.МаксимальнаяШирина;
	
	тНастройкиЭлемента.Вставить("ВыводитьРамку",Результат.НастройкиЭлемента.ВыводитьРамку);
    тНастройкиЭлемента.Вставить("ЦветРамкиЭлемента",Результат.НастройкиЭлемента.ЦветРамкиЭлемента);
	
	тНастройкиЭлемента.Вставить("ЦветТекстаЗаголовка",Результат.НастройкиЭлемента.ЦветТекстаЗаголовка);
	тНастройкиЭлемента.Вставить("ЦветФонаЗаголовка",Результат.НастройкиЭлемента.ЦветФонаЗаголовка);
	
	Возврат ЗначениевСтрокуВнутр(тНастройкиЭлемента);

КонецФункции
